"""
Задание.

Ваша задача по итогам 9 пройденных уроков отобрать
написанные вами скрипты и подготовить для них тесты.
Это могут быть скрипты с вашими именными функциями и ООП-задачи.

Ваша задача отобрать 5 скриптов. На каждый скрипт необходимо подготовить
TestCase, т.е. тестовый случай. В каждом тестовом случае должно быть
КАК МИНИМУМ два теста.

Ваша задача создать папку, назвав ее, например, Lesson_10_Ivanov.
В этой папке создать пять папок для пяти скриптов. task1-task5
В каждой папке должен быть файл со скриптом и файл с тестом.
Например, task_1 и task_1_test.
Папку Lesson_10_Ivanov нужно заархивировать и приложить к форме сдачи задания.

ВНИМАНИЕ: задания, которые будут сданы по-другому, к проверке не принимаются!!

Для получения оценки отлично нужно написать тесты для пяти скриптов.
Общее количество тестов должно равняться не менее 20.

При проверке преподааватель будет запускать тесты и все они "должны проходить",
т.е. завершаться с результатом OK.

При выполнении задания постарайтесь применить как можно больше ф-ций.
модуля unittest.
В каждом тесте должна быть строго одна функция из перечисленных.

+assertEqual(a, b)
+assertNotEqual(a, b)
+assertTrue(x)
+assertFalse(x)
+assertIs(a, b)
+assertIsNot(a, b)
+assertIsNone(x)
+assertIsNotNone(x)
+assertIn(a, b)
assertNotIn(a, b)
+assertIsInstance(a, b)
+assertNotIsInstance(a, b)
+assertRaises(Exception)
"""
